"""
day01 环境搭建及使用
5 python入门演示
"""

"""
5.1 简单的数学运算
"""

print("\n***********************************************************")
print("5.1 简单的数学运算")
print(" (1)整数相加，得到整数: 2 + 2 =", 2 + 2)
print(" (2)整数和浮点数相加，得到浮点数: 2 + 3.6 =", 2 + 3.6)
print(" (3)浮点数相加，得到浮点数: 2.4 + 3.6 =", 2.4 + 3.6)

print("\n***********************************************************")
print("5.2 变量赋值")
a = 20190326
print(" (1)a = ", a)

print("\n***********************************************************")
print("5.3 python字符串")
s = "Hello World!"
print(" (1)字符串生成: s = ",s)
s = """
    Hello 
    World!
"""
print(" (2)多行字符串: s = ",s)
s = "Hello" + " World"
print(" (3)字符串加法: s = ",s)

print("\n***********************************************************")
print("5.4 列表List")
a = [1,2.0,'Hello', 5 + 1.0]
print(" (1)列表生成: a = ",a)
print(" (2)列表加法: a + a = ", a + a)

print("\n***********************************************************")
print("5.4 集合Set")
s = {2, 3, 4, 2}
print(" (1)集合生成: s = ")

