"""
Day2 表达式及控制语句
01 Python运算符
"""
###########算术运算符##########
# + 
# -
# *
# / (除，带小数)
# //(整除，取商的整数部分)
# % (取模，返回除数的余数)
# **(乘幂)
#############################

##########比较运算符##########
# ==
# !=
# >
# <
# >=
# <=
#############################

##########赋值运算符##########
# =
# +=
# -=
# *=
# /=
# %=
# **=
# //=
#############################

############位运算符##########
# &     与
# |     或
# ^     异或
# ~     取反
# <<    左移
# >>    右移
#############################

##########逻辑运算符##########
# and
# or
# not
#############################

##########成员运算符##########
# in
# not in
#############################

##########身份运算符##########
# is
# is not
# is用来判断两个变量引用对象是否是同一个，
# ==用于判断引用变量的值是否相等
# is类似编译原理中的传地址
# ==类似编译原理中的传值
# is判断是否指向同一个地址块
# ==仅仅判断值是否相等
# Python中会为每个出现的对象分配内存，哪怕它们的值完全相等
# 但是为了提高内存利用率，对于一些简单的对象，如一些较小的int
# 型对象，Python采用重用对象内存的办法
#############################
